SURV/src/DataProcessors/ЗагрузкаДанныхИзСКУД/ЗагрузкаДанныхИзСКУД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДанныхИзСКУД</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.Офисы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>События</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Считыватель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дверь</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Карта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Офис</name>
      <type>
        <types>CatalogRef.Офисы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

SURV/src/InformationRegisters/УчетРабочегоВремени/УчетРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетРабочегоВремени</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидВремени</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Офис</name>
    <type>
      <types>CatalogRef.Офисы</types>
    </type>
  </resources>
  <resources>
    <name>ПользовательПодписант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Дверь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SURV/src/Enums/ВидыВремени/ВидыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВремени</name>
  <enumValues>
    <name>ЗарегистрированоПоКарте</name>
  </enumValues>
  <enumValues>
    <name>УчестьВсеВремяКакРабочее</name>
  </enumValues>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезСохраненияЗП</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйВыходной</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>МестнаяКомандировка</name>
  </enumValues>
  <enumValues>
    <name>Учеба</name>
  </enumValues>
  <enumValues>
    <name>Личное</name>
  </enumValues>
</mdclass:Enum>

SURV/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Домен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.Офисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.Отделы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонДобавочный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Родитель1</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель3</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель4</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель5</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель6</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель7</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель8</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

SURV/src/DataProcessors/ЗагрузкаДанныхИзСКУД/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ЗагрузитьСобытия(Команда)
	Если Не ЗначениеЗаполнено(Объект.Офис) Тогда 
		ПоказатьПредупреждение(Неопределено, "Не выбран Офис!");
		Возврат;
	КонецЕсли;
	ЗагрузкаСобытий();
	Элементы.События.Обновить();
	ПоказатьПредупреждение(Неопределено, "Готово!",2);
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаСобытий()
	
	СтруктураПараметров = Новый Структура;
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда 
		СтруктураПараметров.Вставить("ДатаНачала",Объект.ДатаНачала);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда 
		СтруктураПараметров.Вставить("ДатаОкончания",Объект.ДатаОкончания);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Пользователь) Тогда 
		СтруктураПараметров.Вставить("Почта",Объект.Пользователь.Email);
	КонецЕсли;
	
	Объект.События.Очистить();
	ТаблицаСобытий = Сервер.ПолучитьТаблицуСобытийИзСКУД(Объект.Офис,СтруктураПараметров);	
	Если ТаблицаСобытий <> Неопределено Тогда 
		Для Каждого СтрокаТабл Из ТаблицаСобытий Цикл 
			НовСтрокаТЧ = Объект.События.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрокаТЧ,СтрокаТабл);
			НовСтрокаТЧ.Офис = Объект.Офис;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВРегистр(Команда)
	Если Объект.События.Количество() > 0 Тогда 
		ТекстВопроса = "ВНИМАНИЕ! За "+?(ЗначениеЗаполнено(Объект.ДатаНачала) Или ЗначениеЗаполнено(Объект.ДатаОкончания),"период ","весь период работы ") +
						?(ЗначениеЗаполнено(Объект.ДатаНачала),"с "+Формат(Объект.ДатаНачала,"ДФ=дд.ММ.гггг ЧЧ:мм:сс")+" ","") +
						?(ЗначениеЗаполнено(Объект.ДатаОкончания),"по "+Формат(Объект.ДатаОкончания,"ДФ=дд.ММ.гггг ЧЧ:мм:сс")+" ","") + "
						|" + ?(ЗначениеЗаполнено(Объект.Пользователь),"по пользователю "+СокрЛП(Объект.Пользователь)+" ","по всем пользователям офиса "+СокрЛП(Объект.Офис)+" ") + "
						|будут замещены все записи входов/выходов по карточкам!
						|Вы уверены, что хотите продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьВРегистрЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВРегистрЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	ОчиститьСтарыеСобытия();
	ЗаписатьСобытияВРегистр();
	ПоказатьПредупреждение(Неопределено, "Готово!",2);

КонецПроцедуры

&НаСервере
Процедура ОчиститьСтарыеСобытия()
	НачатьТранзакцию();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	УчетРабочегоВремени.Период,
	                      |	УчетРабочегоВремени.Пользователь,
	                      |	УчетРабочегоВремени.ВидВремени,
	                      |	УчетРабочегоВремени.ВремяОкончания,
	                      |	УчетРабочегоВремени.Дверь,
	                      |	УчетРабочегоВремени.Комментарий,
	                      |	УчетРабочегоВремени.Офис
	                      |ИЗ
	                      |	РегистрСведений.УчетРабочегоВремени КАК УчетРабочегоВремени
	                      |ГДЕ
	                      |	УчетРабочегоВремени.Период МЕЖДУ &Дата1 И &Дата2
	                      |	И УчетРабочегоВремени.ВидВремени = &ВидВремени
						  |	И УчетРабочегоВремени.Офис = &Офис
	                      |	И (УчетРабочегоВремени.Пользователь = &Пользователь
	                      |			ИЛИ &Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))");
	Запрос.УстановитьПараметр("Дата1",Объект.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2",?(ЗначениеЗаполнено(Объект.ДатаОкончания),Объект.ДатаОкончания,'39990101'));
	Запрос.УстановитьПараметр("ВидВремени",Перечисления.ВидыВремени.ЗарегистрированоПоКарте);
	Запрос.УстановитьПараметр("Офис",Объект.Офис);
	Запрос.УстановитьПараметр("Пользователь",Объект.Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НабЗап = РегистрыСведений.УчетРабочегоВремени.СоздатьНаборЗаписей();
		НабЗап.Отбор.Период.Установить(Выборка.Период,Истина);
		НабЗап.Отбор.Пользователь.Установить(Выборка.Пользователь,Истина);
		НабЗап.Записать(Истина);
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСобытияВРегистр()
	Сервер.ЗагрузитьСобытияВРегистр(Объект.События,Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
		ВыбранноеЗначение = КонецДня(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры
